src/main/resources/templates/cso-save-filing.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:cso="http://csoextws.jag.gov.bc.ca/">
    <soapenv:Header/>
    <soapenv:Body>
        <cso:saveFiling>
            <userguid>?</userguid>
            <bcolUserId>?</bcolUserId>
            <bcolSessionKey>?</bcolSessionKey>
            <bcolUniqueId>?</bcolUniqueId>
            <efilingPackage>
                <cfcsa>?</cfcsa>
                <classCd>?</classCd>
                <clientRefNo>?</clientRefNo>
                <comments>?</comments>
                <courtFileNumber>?</courtFileNumber>
                <divisionCd>?</divisionCd>
                <documents>
                    <documentType>?</documentType>
                    <filename>?</filename>
                    <initiatingYn>?</initiatingYn>
                    <orderDocument>?</orderDocument>
                </documents>
                <existingFile>?</existingFile>
                <indigent>?</indigent>
                <invoiceNo>?</invoiceNo>
                <levelCd>?</levelCd>
                <locationCd>?</locationCd>
                <notificationEmail>?</notificationEmail>
                <parties>
                    <party>
                        <firstGivenName>?</firstGivenName>
                        <organizationName>?</organizationName>
                        <partyType>?</partyType>
                        <roleType>?</roleType>
                        <secondGivenName>?</secondGivenName>
                        <surnameName>?</surnameName>
                        <thirdGivenName>?</thirdGivenName>
                    </party>
                </parties>
                <por>?</por>
                <prevFileNumber>?</prevFileNumber>
                <processingComplete>?</processingComplete>
                <resubmission>?</resubmission>
                <rush>?</rush>
                <serviceId>?</serviceId>
                <submittedDtm>?</submittedDtm>
                <userAccess>
                    <accountId>?</accountId>
                    <clientId>?</clientId>
                    <privilegeCd>?</privilegeCd>
                </userAccess>
                <eNotification>?</eNotification>
            </efilingPackage>
        </cso:saveFiling>
    </soapenv:Body>
</soapenv:Envelope>